In [1]:
import pandas as pd
import numpy as np

In [2]:
my_data = np.array([[10,20,30,],[20,30,40],[20,50,10],[10,15,20]])

In [3]:
my_data

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 20]])

In [5]:
my_names = ["Alex","Jhon","Mark","Rob"]

In [6]:
my_columns = ["Jan","Feb","Mar"]

In [7]:
my_data_frame = pd.DataFrame(my_data)

In [8]:
my_data_frame

    0   1   2
0  10  20  30
1  20  30  40
2  20  50  10
3  10  15  20

In [9]:
type(my_data_frame)

pandas.core.frame.DataFrame

In [10]:
my_data_frame[1]

0    20
1    30
2    50
3    15
Name: 1, dtype: int32

In [11]:
new_dataFrame = pd.DataFrame(my_data, index=my_names, columns=my_columns)

In [12]:
new_dataFrame

      Jan  Feb  Mar
Alex   10   20   30
Jhon   20   30   40
Mark   20   50   10
Rob    10   15   20

In [14]:
type(new_dataFrame["Feb"])

pandas.core.series.Series

In [15]:
feb_series = new_dataFrame["Feb"]

In [16]:
feb_series

Alex    20
Jhon    30
Mark    50
Rob     15
Name: Feb, dtype: int32

In [17]:
feb_series.Alex

20

In [18]:
feb_series.Rob

15

In [19]:
feb_series.max()

50

In [20]:
new_dataFrame

      Jan  Feb  Mar
Alex   10   20   30
Jhon   20   30   40
Mark   20   50   10
Rob    10   15   20

In [21]:
booleanFrame = new_dataFrame > 25

In [22]:
booleanFrame

        Jan    Feb    Mar
Alex  False  False   True
Jhon  False   True   True
Mark  False   True  False
Rob   False  False  False

In [23]:
new_dataFrame[booleanFrame]

      Jan   Feb   Mar
Alex  NaN   NaN  30.0
Jhon  NaN  30.0  40.0
Mark  NaN  50.0   NaN
Rob   NaN   NaN   NaN

In [24]:
new_dataFrame[new_dataFrame > 30]

      Jan   Feb   Mar
Alex  NaN   NaN   NaN
Jhon  NaN   NaN  40.0
Mark  NaN  50.0   NaN
Rob   NaN   NaN   NaN

In [25]:
new_dataFrame[new_dataFrame["Mar"] > 25]

      Jan  Feb  Mar
Alex   10   20   30
Jhon   20   30   40

In [26]:
new_dataFrame

      Jan  Feb  Mar
Alex   10   20   30
Jhon   20   30   40
Mark   20   50   10
Rob    10   15   20